Revit 2024 API
BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUnique Property
 Sheet views in this model cannot contain more than one instance of "%1!s!."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ViewInAModelMustBeUnique { get; }
Visual Basic
Public Shared ReadOnly Property ViewInAModelMustBeUnique As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ViewInAModelMustBeUnique {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace